#include <iostream>

using namespace std;

int main()

{

	cout << "What is your name? ";

	string name; // створення змінної

	cin >> name; // програма призупиняє свою роботу і чекає на реакцію користувача. після того, як користувач набере рядок тексту та натсне Ентер, робота програми продовжиться

	cout << "Hello, " << name << "!\n";

	cout << "How old are you? ";

	int age; // створення змінної

	cin >> age; // програма призупиняє свою роботу і чекає на реакцію користувача. після того, як користувач набере рядок тексту та натсне Ентер, робота програми продовжиться

	cout << "Next year you will be " << age + 1 << " )))\n";

	// + - * / %

}
